Revit 2024 API
ViewSchedule.CreateKeynoteLegend Method
 Creates a keynote legend.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static ViewSchedule CreateKeynoteLegend(
	Document document
)
Visual Basic
Public Shared Function CreateKeynoteLegend ( _
	document As Document _
) As ViewSchedule
Visual C++
public:
static ViewSchedule^ CreateKeynoteLegend(
	Document^ document
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document to which the new schedule will be added.
Return Value
 The newly created schedule.
Remarks
 A keynote legend is a schedule of the Keynote Tags category.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  document is not a project document.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document has no open transaction.
See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace